app/Repository/AuthorRepository.php

    public function list($pageSize)
    {
        // TODO: Implement list() method.
        return Author::all();
---
select * from `authors`