app/Repository/BookRepository.php

select `books`.`id`, `books`.`title`, `books`.`summary`, `books`.`image`, `books`.`price`, `books`.`quantity`, `authors`.`authorname` as `author`, `publishers`.`publishname` as `publisher`, `categories`.`categoryname` as `category` from `books` left join `authors` on `authors`.`id` = `authorID` left join `publishers` on `publishers`.`id` = `publisherID` left join `categories` on `categories`.`id` = `categoryID` limit 10
---
    public function list($pageSize)
    {
        // TODO: Implement list() method.
        $result = DB::table('books')
            ->leftJoin('authors', 'authors.id', '=', 'authorID')
            ->leftJoin('publishers', 'publishers.id', '=', 'publisherID')
            ->leftJoin('categories', 'categories.id', '=', 'categoryID')
            ->select('books.id', 'books.title', 'books.summary', 'books.image', 'books.price', 'books.quantity', 'authors.authorname as author', 'publishers.publishname as publisher', 'categories.categoryname as category')
            ->take($pageSize)
            ->get();