app/Repository/PublisherRepository.php

select * from `publishers`
---
    public function list($pageSize)
    {
        // TODO: Implement list() method.
        return Publisher::all();