app/Repository/RoleRepository.php

select * from `roles` limit 10
---
    public function list($pageSize)
    {
        // TODO: Implement list() method.
        $roles = DB::table('roles')->take($pageSize)->get();