app/Repository/UserRepository.php

    public function getCount()
    {
        $count = count(User::all());
---
select * from `users`

    public function list($pageSize)
    {
        // TODO: Implement list() method.
        $result = DB::table('users')
            ->leftJoin('roles', 'roles.id', '=', 'users.role')
            ->select('users.id', 'users.firstname', 'users.lastname', 'users.email', 'roles.rolename as role')
            ->take($pageSize)
            ->get();
---
select `users`.`id`, `users`.`firstname`, `users`.`lastname`, `users`.`email`, `roles`.`rolename` as `role` from `users` left join `roles` on `roles`.`id` = `users`.`role` limit 10

    public function findByCode($params, $pageSize, $pageNumber)
    {
        $result = DB::table('users')
            ->leftJoin('roles', 'roles.id', '=', 'users.role')
            ->select('users.id', 'users.firstname', 'users.lastname', 'users.email', 'roles.rolename as role');
            if($params != null)
            {
                foreach ($params as $param)
                {
                    if ($param['value'] != null)
                    {
                        $result->where($param['field'], 'like', $param['value']  . '%');
                    }
                }
            }
            $count = $result->count();
            $result->skip($pageNumber)->take($pageSize);
            return ['result' => $result->get(), 'count' => $count];
---
select count(*) as aggregate from `users` left join `roles` on `roles`.`id` = `users`.`role` where `firstname` like 'A%' and `lastname` like 's%'
select `users`.`id`, `users`.`firstname`, `users`.`lastname`, `users`.`email`, `roles`.`rolename` as `role` from `users` left join `roles` on `roles`.`id` = `users`.`role` where `firstname` like 'A%' and `lastname` like 's%' limit 10 offset 0